sites/main/_posts/2004-09-17-there-is-only-room-for-26-software-vendors.html
---
layout: post
title: There is only room for 26 software vendors
tags:
- integration
---

<p>
Those marketing guys must be rather clueless, lots of software
vendors pick a couple of letters and prefix all their software titles
with it. I can only gues this is due to lack of inspiration or to
create at least the impression that the software is like a suite of
packages which work together (which it does not in most cases) It's
not only the professional marketing departments who lack inspiration,
Open Source developers, whether professional or not, have a liking for
&lt;em&gt;prefabricated&lt;/em&gt; names too. Here's the slate what i could come
up with without much research, lots of letters left, so i you have
some plans grab one, while they are still in stock:
</p>

<ol class="org-ol">
<li>The <b>a</b> is liberally replaced with a <b>@</b> in both names of classes (eM@il) and names of software packages;
</li>
<li>The <b>e</b> seems to have grown into a prefix to be used for a class of
software (eMail, eLearning, eCommerce) roughly describing
<b>doing the classical thing, but then with the internet</b>   (whatever that means in practice);
</li>
<li><b>gnu</b> - Applications which like to identify themselves (i guess) with the FSF or the GNU software set or the GPL (gnuTella,;
</li>
<li><b>g</b> - GNOME stuff;
</li>
<li><b>i</b> - Apple (iTunes, iChat);
</li>
<li><b>k</b> - KDE applications (kNode, kWrite);
</li>
<li><b>moz</b> - Based on mozilla framework (mozBlog, mozEdit) [Note: also the postfix <b>zilla</b> is often used];
</li>
<li><b>x</b> - X windows applications (xChat, xEyes);
</li>
<li><b>xar</b> - Xaraya modules [ hesitated a bit to put this one in ;-) ]
And of course there is microsoft which just puts MS in front of
everything. I'm sure there are more examples, the above is by
head. So, if you want a letter prefix, get one fast; we only have
26 letters.
</li>
</ol>
